Revit 2018 API
IndexStreamLine Class
 A stream that can be used to write line segment primitives into a buffer (see Autodesk::Revit::DB::DirectContext3D::IndexBuffer).
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public class IndexStreamLine : IndexStream
Visual Basic
Public Class IndexStreamLine _
	Inherits IndexStream
Visual C++
public ref class IndexStreamLine : public IndexStream
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexStream
 Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
See Also
IndexStreamLine Members
Autodesk.Revit.DB.DirectContext3D Namespace